#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
module.dynamoDB.aws_iam_group.dynamoDB-read-write-access: Refreshing state... [id=twitter-dynamoDB-read-write-access]
module.authorisation-lambda.aws_iam_group_policy.twitter-auth-api-gateway-policy: Refreshing state... [id=TwitterAuthAPIGateway:twitter-auth-api-gateway-policy]
module.dynamoDB.aws_iam_group_policy.dynamoDB-read-write-accesspolicy: Refreshing state... [id=twitter-dynamoDB-read-write-access:dynamoDB-read-write-access-policy]
module.authorisation-lambda.aws_iam_group.twitter-auth-api-gateway: Refreshing state... [id=TwitterAuthAPIGateway]
module.authorisation-lambda.aws_apigatewayv2_api.twitter-auth-api-gateway-terraform: Refreshing state... [id=ib7xkhk7zh]
module.dynamoDB.aws_dynamodb_table.twitter-auth-dynamoDB: Refreshing state... [id=twitter-auth]
module.authorisation-lambda.aws_cloudwatch_log_group.twitter-auth-cloudwatch: Refreshing state... [id=/aws/lambda/twitter-auth-lambda]
module.authorisation-lambda.aws_iam_role.iam-role-authorisation-lambda: Refreshing state... [id=iam-role-authorisation-lambda]
module.authorisation-lambda.aws_iam_policy.cloudwatch-policy: Refreshing state... [id=arn:aws:iam::388331548819:policy/twitter-authorisation-cloudwatch]
module.authorisation-lambda.aws_apigatewayv2_stage.twitter-auth-api-gateway-stage: Refreshing state... [id=$default]
module.authorisation-lambda.aws_iam_policy_attachment.cloudwatch-policy-attachment: Refreshing state... [id=twitter-authorisation-cloudwatch]
module.authorisation-lambda.aws_lambda_function.twitter-authorisation-lambda: Refreshing state... [id=twitter-auth-lambda]
module.authorisation-lambda.aws_lambda_permission.api-gateway-lambda-permission: Refreshing state... [id=APIGatewayToLambda]
module.authorisation-lambda.aws_apigatewayv2_integration.twitter-auth-api-gateway-lambda-integration: Refreshing state... [id=80ju4ko]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-refresh-route: Refreshing state... [id=oa31ki6]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-token-route: Refreshing state... [id=1gvabem]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-callback-route: Refreshing state... [id=chshgmt]
module.authorisation-lambda.aws_apigatewayv2_route.twitter-auth-api-gateway-authorise-route: Refreshing state... [id=2ya0mhk]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.authorisation-lambda.aws_lambda_function.twitter-authorisation-lambda has changed
  ~ resource "aws_lambda_function" "twitter-authorisation-lambda" {
      - code_signing_config_arn        = "" -> null
      - description                    = "" -> null
        id                             = "twitter-auth-lambda"
      - image_uri                      = "" -> null
      - kms_key_arn                    = "" -> null
      - signing_job_arn                = "" -> null
      - signing_profile_version_arn    = "" -> null
        tags                           = {}
        # (20 unchanged attributes hidden)

      - environment {
          - variables = {
              - "AWS_ACCESS_KEY_ID"     = (sensitive)
              - "AWS_REGION"            = "eu-west-2"
              - "AWS_SECRET_ACCESS_KEY" = (sensitive)
            } -> null
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.authorisation-lambda.aws_iam_group.twitter-auth-api-gateway will be destroyed
  # (because aws_iam_group.twitter-auth-api-gateway is not in configuration)
  - resource "aws_iam_group" "twitter-auth-api-gateway" {
      - arn       = "arn:aws:iam::388331548819:group/TwitterAuthAPIGateway" -> null
      - id        = "TwitterAuthAPIGateway" -> null
      - name      = "TwitterAuthAPIGateway" -> null
      - path      = "/" -> null
      - unique_id = "AGPAVU2S5GCJ6CSQJ5BT2" -> null
    }

  # module.authorisation-lambda.aws_iam_group_policy.twitter-auth-api-gateway-policy will be destroyed
  # (because aws_iam_group_policy.twitter-auth-api-gateway-policy is not in configuration)
  - resource "aws_iam_group_policy" "twitter-auth-api-gateway-policy" {
      - group  = "TwitterAuthAPIGateway" -> null
      - id     = "TwitterAuthAPIGateway:twitter-auth-api-gateway-policy" -> null
      - name   = "twitter-auth-api-gateway-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "execute-api:Invoke"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:execute-api:eu-west-2:388331548819:ib7xkhk7zh/*"
                      - Sid      = "InvokeAPIGateway"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.authorisation-lambda.aws_iam_policy.twitter-auth-api-gateway-policy will be created
  + resource "aws_iam_policy" "twitter-auth-api-gateway-policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "twitter-auth-api-gateway-policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "execute-api:Invoke"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:execute-api:eu-west-2:388331548819:ib7xkhk7zh/*"
                      + Sid      = "InvokeAPIGateway"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.authorisation-lambda.aws_iam_policy_attachment.twitter-auth-api-gateway-policy-attachment will be created
  + resource "aws_iam_policy_attachment" "twitter-auth-api-gateway-policy-attachment" {
      + id         = (known after apply)
      + name       = "twitter-auth-api-gateway"
      + policy_arn = (known after apply)
    }

  # module.dynamoDB.aws_iam_group.dynamoDB-read-write-access will be destroyed
  # (because aws_iam_group.dynamoDB-read-write-access is not in configuration)
  - resource "aws_iam_group" "dynamoDB-read-write-access" {
      - arn       = "arn:aws:iam::388331548819:group/twitter-dynamoDB-read-write-access" -> null
      - id        = "twitter-dynamoDB-read-write-access" -> null
      - name      = "twitter-dynamoDB-read-write-access" -> null
      - path      = "/" -> null
      - unique_id = "AGPAVU2S5GCJ7L6QFCT4O" -> null
    }

  # module.dynamoDB.aws_iam_group_policy.dynamoDB-read-write-accesspolicy will be destroyed
  # (because aws_iam_group_policy.dynamoDB-read-write-accesspolicy is not in configuration)
  - resource "aws_iam_group_policy" "dynamoDB-read-write-accesspolicy" {
      - group  = "twitter-dynamoDB-read-write-access" -> null
      - id     = "twitter-dynamoDB-read-write-access:dynamoDB-read-write-access-policy" -> null
      - name   = "dynamoDB-read-write-access-policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:eu-west-2:388331548819:table/twitter*"
                      - Sid      = "AccessTwitterDynamoDB"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.dynamoDB.aws_iam_policy.dynamoDB-read-write-access-policy will be created
  + resource "aws_iam_policy" "dynamoDB-read-write-access-policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "dynamoDB-read-write-access-policy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:388331548819:table/twitter*"
                      + Sid      = "AccessTwitterDynamoDB"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.dynamoDB.aws_iam_policy_attachment.dynamoDB-read-write-access-policy-attachment will be created
  + resource "aws_iam_policy_attachment" "dynamoDB-read-write-access-policy-attachment" {
      + id         = (known after apply)
      + name       = "dynamoDB-read-write-access"
      + policy_arn = (known after apply)
      + roles      = [
          + "iam-role-authorisation-lambda",
        ]
    }

Plan: 4 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @MugishaU, Action: `pull_request`*